(function(){
	miData = {
		
		starGoods : {
			borderColor : ['#ffcccc','#33ff00','#0033ff','#cc0033','#ffff00','#ccff00','#ff0000','#66ff00','#ff99ff','#0000ff'],
			imgSrc : ['img/starGoods/1.jpg','img/starGoods/2.jpg','img/starGoods/3.jpg','img/starGoods/4.jpg','img/starGoods/5.jpg','img/starGoods/6.jpg','img/starGoods/7.jpg','img/starGoods/8.jpg','img/starGoods/9.jpg','img/starGoods/10.jpg'],
			imgAlt : [],
			title : ['进击的巨人' , 'BEM' , '一拳超人', '海盗战绩' , '鬼灭之刃','火影忍者','妖精的尾巴' ,'魔法禁书目录' ,'擅长捉弄的高木同学' ,'海贼王'],
			detail : ['守护我的家园' , '超乎想象' , '拳头就是武器' , '都天都要起航' , '刃之锋，心之切' , '忍者之道','保护同伴','我就是主角','双向暗恋','梦想留下的泪水'],
			price : ['' , '' ,'' ,'','','','','','','']
		},

		match:{
			hot:{
				title : ['小米插线板' , '小米移动电源10000mAh','小米移动电源10000mAh 高配版' ,'小米蓝牙耳机','小米活塞耳机 标配版','小米蓝牙音箱','小米铁圈耳机','小钢炮蓝牙音箱'],
				price : ['79元','69元','499元','29元','69.9元','129元','69元','118元'],
				comment : ['19.1万','15.2万','19.1万','15.2万','6666','5000','5万','1万']
			},
			earphone:{
				title : ['小米插线板' , '小米移动电源10000mAh','小米移动电源10000mAh 高配版' ,'小米蓝牙耳机','小米活塞耳机 标配版','小米蓝牙音箱','小米铁圈耳机','小钢炮蓝牙音箱'],
				price : ['79元','69元','499元','29元','69.9元','129元','69元','118元'],
				comment : ['19.1万','15.2万','19.1万','15.2万','6666','5000','5万','1万']
			},
			card:{
				title : ['小米插线板' , '小米移动电源10000mAh','小米移动电源10000mAh 高配版' ,'小米蓝牙耳机','小米活塞耳机 标配版','小米蓝牙音箱','小米铁圈耳机','小钢炮蓝牙音箱'],
				price : ['79元','69元','499元','29元','69.9元','129元','69元','118元'],
				comment : ['19.1万','15.2万','19.1万','15.2万','6666','5000','5万','1万']
			},
			power:{
				title : ['小米插线板' , '小米移动电源10000mAh','小米移动电源10000mAh 高配版' ,'小米蓝牙耳机','小米活塞耳机 标配版','小米蓝牙音箱','小米铁圈耳机','小钢炮蓝牙音箱'],
				price : ['79元','69元','499元','29元','69.9元','129元','69元','118元'],
				comment : ['19.1万','15.2万','19.1万','15.2万','6666','5000','5万','1万']
			},
			length : 4,
			attr : ['hot' , 'earphone' , 'card' , 'power']
		}


		
	};
	window.miDate = miData;
})();